Autodesk.Revit.DB.Mechanical.Duct.CreatePlaceholder(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new placeholder duct.
document:
The document.
systemTypeId:
The id of the HVAC system type.
ductTypeId:
The id of the duct type.
levelId:
The level id for the duct.
firstPoint:
The first point of the placeholder line.
secondPoint:
The second point of the placeholder line.
Returns:
The placeholder duct.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The systemTypeId is not valid HVAC system type.
-or-
The duct type ductTypeId is not valid duct type.
-or-
The level id levelId is not valid.
-or-
The points of firstPoint and secondPoint are equal.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2014

Autodesk.Revit.DB.Mechanical.Duct.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new duct.
document:
The document.
systemTypeId:
The id of the HVAC system type.
ductTypeId:
The id of the duct type.
levelId:
The level id for the duct.
firstPoint:
The first point of the duct.
secondPoint:
The second point of the duct.
Returns:
The placeholder duct.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The systemTypeId is not valid HVAC system type.
-or-
The duct type ductTypeId is not valid duct type.
-or-
The level id levelId is not valid.
-or-
The points of firstPoint and secondPoint are equal.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2014